tap "danielbayley/adobe", "https://github.com/danielbayley/homebrew-adobe.git"
tap "danielbayley/alfred", "https://github.com/danielbayley/homebrew-alfred.git"
tap "danielbayley/changelog", "https://github.com/danielbayley/homebrew-changelog.git"
tap "danielbayley/dotfiles", "https://github.com/danielbayley/homebrew-dotfiles.git"
tap "danielbayley/fonts"
tap "danielbayley/music", "https://github.com/danielbayley/homebrew-music.git"
tap "danielbayley/private", "https://github.com/danielbayley/homebrew-private.git"
tap "danielbayley/sandbox", "https://github.com/danielbayley/homebrew-sandbox.git"
tap "danielbayley/scripts", "https://github.com/danielbayley/homebrew-scripts.git"
tap "eth-p/software"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "ilyes512/boilr"
tap "kylef/formulae"
tap "nrlquaker/createzap"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "veertuinc/anka"
# File system integration
cask "osxfuse"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic updates
brew "danielbayley/scripts/auto-update", restart_service: :changed
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Modern replacement for 'ls'
brew "exa"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Play, record, convert, and stream audio and video
brew "ffmpeg", args: ["with-fdk-aac"]
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Library to render SVG files using Cairo
brew "librsvg"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Mac App Store command-line interface
brew "mas"
# Media server software, compliant with DLNA/UPnP-AV clients
brew "minidlna", restart_service: :changed
# Platform built on V8 to build network applications
brew "node"
# Read-write NTFS driver for FUSE
brew "ntfs-3g"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Fuzzy Finder in rust!
brew "sk"
# Version control system designed to be a better CVS
brew "subversion"
# Cleans your SVG files by removing unnecessary data
brew "svgcleaner"
# Manipulate and query tags on macOS files
brew "tag"
# Simplified and community-driven man pages
brew "tldr"
# CLI tool that moves files or folder to the trash
brew "trash"
# Command-line unarchiving tools supporting multiple formats
brew "unar"
# Watch files and take action when they change
brew "watchman"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Next-generation plugin manager for zsh
brew "zplug"
# Personal Zsh configuration
brew "danielbayley/dotfiles/zdotdir", restart_service: :changed
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Boilerplate template manager that generates files or directories from template repositories
brew "ilyes512/boilr/boilr"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Dark theme for Ableton Live
cask "ableton-live-theme-dracula"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud"
# Utility to clean up corrupted installations of Adobe software
cask "adobe-creative-cloud-cleaner-tool"
# Manual bug exploiter for the Adobe CC suite
cask "adobe-zii", args: { "no-quarantine": true }
# Collection of presets for Adobe After Effects
cask "ae-preset-conigs-mixtape"
# Screen mirroring receiver
cask "airserver"
# Spreadsheet-database hybrid cloud collaboration
cask "airtable"
# Application launcher and productivity software
cask "alfred"
# Use Numi with Alfred for quick calculations
cask "alfred-numi"
# Dark theme for Alfred
cask "alfred-theme-dracula"
# Android SDK component
cask "android-platform-tools"
# CLI tool for managing and creating macOS virtual machines
cask "anka-virtualization-beta"
# Cross-platform text editor
cask "atom-beta"
# Instantly crop compositions to fit their contents in After Effects
cask "auto-crop"
# Download Backblaze restored files more reliabily
cask "backblaze-downloader"
# Menu bar icon organizer
cask "bartender"
# Online gaming platform
cask "battle-net"
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Design your own LEGO parts
cask "bricklink-partdesigner"
# Build, render, and create LEGO instructions
cask "bricklink-studio"
# Screen saver based on animations presented during Apple Special Event Brooklyn
cask "brooklyn"
# The stroke cap selector Adobe kinda forgot
cask "buttcapper"
# Tool to list all active shortcuts of the current application
cask "cheatsheet"
# Open source clone of Theme Hospital
cask "corsixth"
# Disk space visualizer
cask "daisydisk"
# Sound and music editor
cask "danielbayley-ableton-live-suite", args: { "no-quarantine": true }
# Binary releases of VS Code without MS branding/telemetry/licensing
cask "danielbayley-vscode", args: { "no-quarantine": true }
# API documentation browser and code snippet manager
cask "dash"
# Database browser for SQLite (DB4S) project
cask "db-browser-for-sqlite"
# Screenshot and screen recorder
cask "droplr"
# File sharing solution
cask "dropshare"
# Tool for using an iPad as a second display
cask "duet"
# Improved expression workflow in After Effects
cask "expressionist"
# Cross-platform web browser
cask "firefox"
# Adobe Flash player plugin for Safari and Firefox
cask "flash-npapi"
# Download manager with a torrent client
cask "folx"
# Monospaced font with programming ligatures
cask "font-fira-code-nerd-font"
# Sans serif based on signage in the Montserrat neighborhood of Buenos Aires
cask "font-montserrat"
# GitHub icons font
cask "font-octicons"
# Messaging app for WhatsApp, Facebook Messenger, Slack, Telegram and more
cask "franz"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Git client focusing on productivity
cask "gitkraken"
# Hospital simulator
cask "gog-theme-hospital"
# Cross-platform web browser
cask "google-chrome"
# Music player
cask "harmony"
# Automated organization
cask "hazel"
# Terminal built on web technologies
cask "hyper"
# Test out icon image files in the dock
cask "icon-tester"
# iPhone management application
cask "imazing"
# Spots differences in text and image files
cask "kaleidoscope"
# Build customizable toolbars for After Effects
cask "kbar"
# Free cross-platform password manager compatible with KeePass
cask "keeweb"
# Edit selected keyframes across multiple properties or layers in After Effects
cask "key-cloner"
# Simple keyboard locker
cask "keyboard-lock"
# IK system for After Effects that makes limbs for character animation
cask "limber"
# Tool to change system icons
cask "liteicon"
# Detailed information on every Apple product ever made
cask "mactracker"
# Fork of Nylas Mail
cask "mailspring"
# Harmonic mixing for DJs and music producers
cask "mixed-in-key"
cask "move-anchor-point"
# Cross-platform music tagger
cask "musicbrainz-picard"
# Free and open-source RSS reader
cask "netnewswire"
# Stem file authoring
cask "ni-stemcreator"
# Native code editor
cask "nova"
# Interactive computing suite
cask "nteract"
# Calculator and converter application
cask "numi"
# Screensaver with octicons
cask "octoscreen"
# Vector animation workflow for Illustrator and After Effects
cask "overlord"
# Extract files and folders from package files, disk images, and archives
cask "pacifist"
# Workflow application to improve productivity
cask "pastebot"
# Utility to display the Dock in the Touch Bar
cask "pock"
# Watch movies and TV shows instantly
cask "popcorn-time"
# QuickLook plug-in that renders source code with syntax highlighting
cask "qlcolorcode"
# QuickLook generator for Markdown files
cask "qlmarkdown"
# All-in-one bookmark manager
cask "raindropio"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# File sync and share software
cask "resilio-sync"
# Font manager that helps preview, install, sync and manage fonts
cask "rightfont"
# The fastest and simplest way to rig and animate characters in After Effects
cask "rubberhose"
# Workstation to streamline your accounts, apps, and workflows
cask "shift"
# Virtual reality content platform
cask "sidequest"
cask "silverlight"
# Collect, organize & share colors
cask "sip"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Cloud-based music creation and collaboration platform
cask "splice"
# Music streaming service
cask "spotify"
# Workspace to manage all your productivity apps from one place
cask "stack-stack"
# Starcraft II engine recreation of classic Starcraft and Brood War campaigns
cask "starcraft-mass-recall"
# Video game digital distribution service
cask "steam"
# Open-source media center
cask "stremio"
# Mux and tag mp4 files
cask "subler"
# Command-line version of Subler
cask "sublercli"
# Git client
cask "sublime-merge"
# Control windows and applications right from your trackpad
cask "swish"
# Service that allows users to make symbolic links in the Finder
cask "symboliclinker"
# Terminal for a more modern age
cask "terminus"
# Unpacks archive files
cask "the-unarchiver"
# Helper application for Things
cask "thingsmacsandboxhelper"
# Window manager
cask "tiles"
# Modular touch control surface bridge for OSC & MIDI
cask "touchosc-bridge"
# Modular touch control surface editor for OSC & MIDI
cask "touchosc-editor"
# Git client focusing on power and productivity
cask "tower"
# Open-source BitTorrent client
cask "transmission"
# Refined Evernote desktop app
cask "tusk"
# Twitter client
cask "tweetbot"
# Extract pre-comp layers into the parent composition in After Effects
cask "un-precompose"
# Turn websites into apps
cask "unite"
# USB and Bluetooth device driver
cask "usb-overdrive"
cask "veertu-desktop"
# App to run other operating systems without rebooting
cask "vmware-fusion"
# Torrent streaming application
cask "webtorrent"
# Tools for measuring, inspecting & testing on-screen graphics and layouts
cask "xscope"
# Share, organize and collaborate on designs
cask "zeplin"
# Video communication and virtual meeting platform
cask "zoomus"
# CEP extension installer for Adobe After Effects and Premiere Pro
cask "zxp-installer"
mas "AdGuard for Safari", id: 1440147259
mas "Apple Configurator 2", id: 1037126344
mas "Buffer", id: 1474298973
mas "Calcbot", id: 931657367
mas "Developer", id: 640199958
mas "Drafts", id: 1435957248
mas "Evernote", id: 406056744
mas "Evernote Web Clipper", id: 1481669779
mas "Grammarly for Safari", id: 1462114288
mas "Hidden Bar", id: 1452453066
mas "Honey", id: 1472777122
mas "Keynote", id: 409183694
mas "Mactracker", id: 430255202
mas "Money", id: 1185488696
mas "Numbers", id: 409203825
mas "Octotree", id: 1457450145
mas "Pages", id: 409201541
mas "Plash", id: 1494023538
mas "Pocket", id: 568494494
mas "Raindrop.io for Safari", id: 957810159
mas "ReadKit", id: 588726889
mas "SnippetsLab", id: 1006087419
mas "Spark", id: 1176895641
mas "Things", id: 904280696
