# [Homebrew](http://brewformulas.org)
# [Casks](http://caskroom.io)
## [mas-cli](https://github.com/argon/mas)

#cask_args appdir: '/Applications' #, args: { appdir: '~/Applications'}
#unless File.directory?(ENV['HOME'] + '/?')

#tap 'homebrew/bundle'
#tap 'homebrew/dupes'
#brew 'cask' #brew 'caskroom/cask/brew-cask'
#tap 'caskroom/cask'
tap 'caskroom/versions'
brew 'mas'
tap 'danielbayley/homebrew-ery'
tap 'codeclimate/formulae'

#-------------------------------------------------------------------------------

## System
mas 'macOS Sierra', id: 1127487414
#mas 'macOS Server', id: 883878097
mas 'Apple Configurator 2', id: 1037126344
brew 'ansible'
#tap 'thoughtbot/formulae'
#brew 'rcm'
cask 'docker'
cask 'veertu-desktop' #mas 'veertu', id: 1024069033 #'veertu 2016 business', id: 1082458124
cask 'vagrant'
brew 'packer'
#cask 'vmware-fusion'
#brew 'bash'
### zsh
brew 'zplug'
#brew 'zsh-syntax-highlighting'
brew 'shellcheck'
brew 'cmake'
brew 'pick'

cask 'hyper' #black-screen

cask 'usb-overdrive'

#-------------------------------------------------------------------------------

cask 'hazel'
tap 'homebrew/services'
brew 'osxutils' #trash
brew 'hardlink-osx' #hardlink
brew 'coreutils'
brew 'moreutils'
brew 'aliaspath'
brew 'symlinks'
cask 'symboliclinker'
#brew 'stow'
brew 'unar'

#cask 'secrets'
#cask 'preferencecleaner'
#cask 'magic-launch'
#cask 'rcdefaultapp'

#brew 'sidebarfinagler'
#cask 'xtrafinder' #mas 'forklift', id: 412448059 #cask 'commander-one'
#cask 'asepsis' # http://pixelcog.com/blog/2016/disable-ds_store-in-el-capitan
cask 'clusters'
mas 'DaisyDisk', id: 411643860 #cask 'daisydisk'
#cask 'gemini' #mas 'Duplicate Detective', id: 686428787
#cask 'renamer' FIXME
mas 'Mactracker', id: 430255202 #cask 'mactracker'
cask 'pacifist'
#cask 'cleanmymac' #mas 'CleanMyDrive 2', id: 523620159
#cask 'endurance'
cask 'imazing'

cask 'transmission'
#brew 'transmission', restart_service: :changed FIXME crashes hard!
cask 'resilio-sync'
#cask 'jdownloader'
#cask 'dropbox'
mas 'CloudApp', id: 417602904 #cask 'cloud' #cask 'cloudup'
#cask 'minbox'

## Security
mas '1Password', id: 443987910 #cask #mas 'wallet', id: 404234608
brew 'onepass'
#cask 'encryptr'
brew 'gpg'
#cask 'keeweb'
#brew 'keybase'
brew 'tccutil'
#cask 'management-tools'
#cask 'privacy-services-manager'
#brew 'pass'
#mas 'Better', id: 1121192229
#brew 'torbrowser'

#-------------------------------------------------------------------------------

## UI/X
#cask 'lumen'
cask 'alfred' #mas 'Alfred', id: 405843582 #cask 'launchbar'
#cask 'bartender'
#mas 'Battery Indicator', id: 0
cask 'liteicon'
#cask 'flavours'
#cask 'candybar'
cask 'icon-tester'
cask 'qdesktop'

brew 'tag'
#mas 'PushPal - for PushBullet', id: 909832412 #mas 'Pushbullet', id: 948415170
#cask 'notifyr'
brew 'terminal-notifier'
brew 'dockutil'

cask 'cheatsheet'
#cask 'functionflip'
'Pastebot', id: 1179623856 #mas #'Copied', id: 1026349850
cask 'quadrosync'
mas 'Gifox', id: 1082624744 #cask 'kap' #mas 'GIPHY CAPTURE', id: 668208984
brew 'gifsicle'
#cask 'pashua'

## QuickLook
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'qlswift'
cask 'scriptql'
#cask 'quicklook-csv'
#cask 'quicklook-json'
cask 'brushviewql'
#cask 'betterzipql'

#-------------------------------------------------------------------------------

## Email
cask 'nylas-mail' #cask 'polymail' FIXME #mas 'Airmail 3', id: 918858936

## Workflow
cask 'things' #mas 'Things', id: 407951449
mas 'Evernote', id: 406056744 #cask 'evernote'
#mas 'Alternote', id: 974971992
brew 'wakatime-cli'
#mas 'Billings Pro', id: 434514810
#cask 'money'
#cask 'bitpay'
#mas 'Timing', id: 431511738 #cask 'timing'
mas 'Calcbot', id: 931657367 #cask 'numi'
mas 'Numbers', id: 409203825

## Reading
mas 'ReadKit', id: 588726889 #mas 'Reeder 3', id: 880001334
#cask 'winds'
mas 'Pocket', id: 568494494
cask 'raindropio'

## Social
mas 'Tweetbot', id: 557168941
cask 'franz'
#mas 'Slack', id: 803453959 #cask 'slack'
#cask 'gitter'
#cask 'chitchat'
#cask 'skype' #discord

#cask 'nteract'
#mas 'Ulysses', id: 623795237
#cask 'mou' #typora #whiskey #mas 'Bear', id: 1091189122
#mas 'Deckset', id: 847496013
#brew 'poppler'
#mas 'meditor', id: 1065718148
#cask 'ghost'
#cask 'microsoft-office'

#-------------------------------------------------------------------------------

## Design
cask 'adobe-creative-cloud'
cask 'adobe-creative-cloud-cleaner-tool'
#cask 'adobe-illustrator-cc'
#cask 'adobe-photoshop-cc'
#cask 'adobe-indesign-cc'
#cask 'adobe-after-effects-cc'
#cask 'cuda'
#cask 'adobe-media-encoder-cc'
#cask 'adobe-premiere-pro-cc'

#cask 'lingo'
#cask 'noun-project'
mas 'Sip', id: 507257563

#cask 'sketch' #vectr
#App*s/Sketch.app/*/*/sketchtool/install.sh
#cask 'sketch-toolbox'

cask 'folio'
cask 'zeplin'
cask 'framer'
#cask 'invisionsync' #craft TODO?
#cask 'adobe-experience-design-cc' TODO?
#cask 'origami'
#cask 'balsamiq-mockups'
#cask 'principle' #pixate-studio
cask 'livesurface-context'
cask 'scenery'

#cask 'wacom-bamboo-tablet'

### Typography
cask 'rightfont'
#cask 'fontstand'
cask 'woff2sfnt-sfnt2woff' #sfnt2woff TODO
#tap 'font-octicons'
#brew 'fontforge'
#tap 'caskroom/fonts' # TODO # NOTE hardlinks into ~/Library/Fonts
#cask 'font-hasklig'
#cask 'font-fira-code'
#cask 'font-hack' #caskroom/fonts/font-hack
#cask 'font-cousine'
#cask 'font-droid-sans-mono'

brew 'graphicsmagick'
brew 'svg2png'
#mas 'svgsus', id: 1106867065
brew 'png2ico'
#cask 'icons'
brew 'pngcrush'
#brew 'libicns'
#brew 'gifsicle'
#cask 'xscope'

## Development
#brew 'git'
#brew 'gitsh'
brew 'hub'
brew 'git-lfs'
brew 'git-extras'
#cask 'kaleidoscope'
cask 'ksdiff'
cask 'gitkraken' #github-desktop
#cask 'tower'
#cask 'deckhub'
brew 'gist'
#brew 'autoenv' #direnv
brew 'codeclimate'

## IDE
cask 'atom' #atom-beta
cask 'sublime-text'
cask 'coda'
brew 'coda-cli'
mas 'Xcode', id: 497799835
cask 'alcatraz'
#mas 'Hammer', id: 548600167
#cask 'cactus'
#cask 'mixture'
mas 'SnippetsLab', id: 1006087419 #mas 'Quiver', id: 866773894
cask 'dash'
#cask 'avocode'

## mac/iOS
#brew 'swift'
brew 'cocoapods'
#brew 'swiftgen'

## Web
brew 'hugo'
brew 'sassc'
brew 'discount'
#brew 'watch'

brew 'nginx'
#tap 'homebrew/apache' TODO
#brew 'mod_?'
brew 'dnsmasq', restart_service: :changed
brew 'namebench' #cask
brew 'wget'
brew 'webarchiver'

cask 'google-chrome'
cask 'firefox'
#cask 'brave'
cask 'flash-player'
cask 'silverlight'
cask 'java'

brew 'node'
#brew 'npm'
#brew 'coffeescript'
#brew 'brew-gem'
brew 'jq'
brew 'tidy-html5'
brew 'pandoc'
brew 'smartypants'
brew 'csv-fix'
#brew 'xmlstarlet'

## Python
#brew 'brew-pip' #sudo easy_install pip

#-------------------------------------------------------------------------------

## Audio
cask 'ableton-live-suite'
cask 'mixed-in-key'
cask 'cycling74-max'
cask 'stemcreator'
cask 'touchosc-editor'
cask 'touchosc-bridge'
cask 'splice'
#cask 'soundcleod'
#cask 'spotify'

cask 'subler'
cask 'sublercli'
mas 'Squeed', id: 1055310524 #cask 'the-tagger'
brew 'ffmpeg' #--with-theora --with-libvorbis #mas 'Permute 2', id: 731738567
brew 'flac'
#brew 'cuetools'
#brew 'shntool'
brew 'exiftool'
#cask 'beatport-pro'
#cask 'soundflower'
#cask 'faw-circle'
#cask 'circle-wavetable-generator'
#mas 'Audulus 3', id: 1031667826

## Video
cask 'beardedspice'
brew 'minidlna'
cask 'airserver'
#cask 'duet'
#cask 'vlc'
#cask 'mplayerx'
#cask 'maddthesane-perian'
#cask 'flip4mac'

## Entertainment
cask 'webtorrent'
#tap 'asio/popcorn-time' #casidiablo/custom
cask 'popcorn-time'

### Gaming
cask 'battle-net'
#mas 'Worms Revolution', id: 616018342
#cask 'lego-digital-designer'
#mas 'Bike Baron', id: 539235808
#cask 'unity-web-player'
#### Theme Hospital
#brew 'lua'
#exec 'luarocks install lpeg' #luafilesystem
#tap 'games'
#brew 'corsixth'
#linkapps 'corsixth' #exec 'brew linkapps corsixth'
#cask 'danielbayley/theme-hospital' TODO?

#-------------------------------------------------------------------------------

#cleanup
